
function ltrim(str){
//-------------------------------------------------------
//函式: ltrim
//用途: 去左邊空白字元
//-------------------------------------------------------
    str=str.toString();
    return str.replace(/^\s*/,"");
}

function rtrim(str){
//-------------------------------------------------------
//函式: rtrim()
//用途: 去右邊空白字元
//-------------------------------------------------------
    str=str.toString();
    return str.replace(/\s*$/,"");
}

function chop(str){
//-------------------------------------------------------
//函式: chop()
//用途: 去右邊空白字元
//-------------------------------------------------------
    str=str.toString();
    return str.replace(/\s*$/,"");
}

function trim(str){
//-------------------------------------------------------
//函式: trim()
//用途: 去前後空白字元
//-------------------------------------------------------
    str=str.toString();
    str=str.replace(/^\s+/,'');
    str=str.replace(/\s+$/,'');
    return str;
}
